# Введення рядка
string = input('Введіть рядок: ')
print('Ви ввели: "', string, '"', sep='')

# Запрошення можна не вказувати:
# # string = input()
# # Результат, який повертає будь-яка функція, можна не прив'язувати до жодного імені.
# # Таким чином, наступний рядок просто змусить # програму чекати, поки користувач щось
# # введе або просто натисне Enter, а потім вона продовжить виконання.
input()

# введемо два числа
n = int(input('Введіть перше число: '))
m = int(input('Введіть друге число: '))
print('{} + {} = {}'.format(n, m, n + m))
print()
print('{0} + {1} = {2}.\nПеревірка: {2} - {1} = {0}'.format(n, m, n + m))
#також можна використовувати f-рядки
print(f'{n} + {m} = {n + m}')
print(f'{n} + {m} = {n + m}.\nПеревірка: {n + m} - {m} = {n}')
print()

# Аналогічний варіант виводу
print(n, "+", m, "=", n + m)

